using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace MyNameSpace
{
    public class MyProp
    {
        public string MyFirstProp { get; set; }

        public int MySecondProp { get; set; }

        //یک پروژه کلاس لایبرری دات نت فریم ورک یا دات نت کور در سلوشن میسازیم که خوروجی دی ال ال  دارد. سپس یک کلاس پابلیک با پراپرتی های و متد های پابلیک اضافه میکنیم  و سپس پروژه را بیلد میکنیم. به پروزه قبلی میریم و این پروژه را اد  رفرنس میکنیم و بعد نیم اسپیسش را در ان یوزینگ میکنیم و بعد از کلاس ها و متد هایش استفاده میکنیم. 
        //این پروژه یک کلاس لایبرری بود . پسوند دی ال ال داره
        //کلاس لایبرری ها کلاس های پابلیک هستند که میسازیم و کد هارو توشون ذخیره میکنیم که بار ها و بارها استفاده کنیم
        //باید اول بیلد بشوند
        //اد رفرنس بشوند به پروژه ای که میخوایم توش از کلاس لایبرری مون استفاده کنیم 
        //و بعد نیم اسپیسش یوزینگ شود در جایی که میخوایم استفاده کنیمش
        //کلاس لایبرری رو میتونیم به هر پروژه ای که خواستیم اضافه کنیم
        //فایل دی ال ال یک فایل اجرایی مثل اگزه هستش فقط اگزه خودش اجرا میشه دی ال ال باید توسط یه برنامه در حال اجرا فراخوانی بشه تا
        //کد هاش اجرا بشوند
        //بعد از بیلد کردن برنامه کلاس لایبرری اگه نیاز بود که دی ال الش را پیداش کنیم در پوشه بین و بعد دیباگ پروژه خودش قرار دارد


    }
}
